# GetReleaseType Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelStick..::..GetReleaseType Method
AnalyticalModelStick Class See Also
---
Gets the release type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ReleaseType GetReleaseType(
	bool start
)
```

Visual Basic
---
```text
Public Function GetReleaseType ( _
	start As Boolean _
) As ReleaseType
```

Visual C++
---
```text
public:
ReleaseType GetReleaseType(
	bool start
)
```

# ### Parameters
start
    Type: System..::..Boolean The position on analytical model stick element. True for start, false for end.
# ### Return Value
The type of release.
# See Also
AnalyticalModelStick Class
Autodesk.Revit.DB.Structure Namespace